tutorials/force/bm1.58n0.5/constant/postProcessingProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      postProcessingProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

deleteParentOutputDirectory false;

data
{
    callName surfaceElevation;

    removeDuplicate true;
    inputDir surfaceElevation;

    deltaT 0.2;

    // action list is a set of processes on the data
    actionList (interpolateSurfaceElevation write2Ascii removeData);
}

// ************************************************************************* //
